# Taps
# TODO: remove if unneeded
# tap "jesseduffield/lazydocker"
# tap "oven-sh/bun"

# Brews
brew "atuin"
brew "bat"
brew "bat-extras"
brew "bottom"
brew "carapace"
brew "direnv"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "starship"
brew "tree"
brew "zoxide"
brew "jesseduffield/lazydocker/lazydocker"

# Casks (macOS)
cask "balenaetcher"
cask "brave-browser"
cask "cleanshot"
cask "drawio"
cask "figma"
cask "ghostty"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "leader-key"
cask "legcord"
cask "miro"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "pearcleaner"
cask "qbittorrent"
cask "raycast"
cask "rustdesk"
cask "tableplus"
cask "visual-studio-code"
cask "vlc"
cask "zed"
cask "zotero"

cask "font-atkinson-hyperlegible"
cask "font-symbols-only-nerd-font"
