tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# General-purpose data compression with high compression ratio
brew "xz"
# Core application library for C
brew "glib"
# Portable Foreign Function Interface library
brew "libffi"
# X.Org: Core X11 protocol client library
brew "libx11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Modern replacement for 'ls'
brew "exa"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Nice to use pager for humans
brew "moar"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Tool Command Language
brew "tcl-tk"
# Simplified and community-driven man pages
brew "tldr"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Memory training application
cask "anki"
# Display management tool
cask "betterdisplay"
# Screen capturing tool
cask "cleanshot"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# App to build and share containerized applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Git client focusing on productivity
cask "gitkraken"
# Free and open-source media player
cask "iina"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# GPU-based terminal emulator
cask "kitty"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open source virtual/remote desktop application
cask "rustdesk"
# Instant messaging application focusing on security
cask "signal"
# Real time file synchronization software
cask "syncthing"
# Customizable email client
cask "thunderbird"
# Git client focusing on power and productivity
cask "tower"
# Virtual machines UI using QEMU
cask "utm"
# Development environment
cask "vagrant"
# Gives Vagrant VMware plugin access to various VMware functionalities
cask "vagrant-vmware-utility"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Craft", id: 1487937127
mas "Dark Noise", id: 1465439395
mas "Dark Reader for Safari", id: 1438243180
mas "Darkroom", id: 953286746
mas "GoodLinks", id: 1474335294
mas "GoodNotes", id: 1444383602
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "MarginNote 3", id: 1423522373
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "NCalc Fx", id: 1449106995
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Things", id: 904280696
