tap "cirruslabs/cli"
tap "eth-p/software"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "pulumi/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Portable Foreign Function Interface library
brew "libffi"
# X.Org: Core X11 protocol client library
brew "libx11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# GNU File, Shell, and Text utilities
brew "coreutils"
# CPU architecture fetching tool
brew "cpufetch"
# Load/unload environment variables based on $PWD
brew "direnv"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Rainbows and unicorns in your console!
brew "lolcat"
# Move files and folders to the trash
brew "macos-trash"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Modern shell for the GitHub era
brew "nushell"
# Development kit for the Java programming language
brew "openjdk"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Emulator for x86 and PowerPC
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool Command Language
brew "tcl-tk"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Run macOS VMs on Apple Silicon
brew "cirruslabs/cli/tart"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Terraform
brew "hashicorp/tap/terraform"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Memory training application
cask "anki"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Display management tool
cask "betterdisplay"
# Screen capturing tool
cask "cleanshot"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# App to build and share containerized applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Font with greater legibility and readability for low vision readers
cask "font-atkinson-hyperlegible"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# Git client focusing on productivity
cask "gitkraken"
# Open-source video transcoder
cask "handbrake"
# Free and open-source media player
cask "iina"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# App to manage software development and track bugs
cask "linear-linear"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open source virtual/remote desktop application
cask "rustdesk"
# Web browser
cask "sigmaos"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# Real time file synchronization software
cask "syncthing"
# Customizable email client
cask "thunderbird"
# Git client focusing on power and productivity
cask "tower"
# Virtual machines UI using QEMU
cask "utm"
# Development environment
cask "vagrant"
# Keyboard configurator
cask "via"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Craft", id: 1487937127
mas "Dark Noise", id: 1465439395
mas "Dark Reader for Safari", id: 1438243180
mas "Darkroom", id: 953286746
mas "Expenses", id: 1492055171
mas "GoodLinks", id: 1474335294
mas "GoodNotes", id: 1444383602
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "MarginNote 3", id: 1423522373
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "NCalc Fx", id: 1449106995
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Omnivore", id: 1564031042
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "Xcode", id: 497799835
mas "xSearch", id: 1579902068
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "antfu.theme-vitesse"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "atomiks.moonlight"
vscode "azemoh.one-monokai"
vscode "Catppuccin.catppuccin-vsc"
vscode "ChakrounAnas.turbo-console-log"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "dustypomerleau.tol"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enkia.tokyo-night"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "GitHub.codespaces"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "hyrious.import-cost"
vscode "KevinRose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "mvllow.rose-pine"
vscode "naumovs.color-highlight"
vscode "PKief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "pomdtr.excalidraw-editor"
vscode "rangav.vscode-thunder-client"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tal7aouy.theme"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tinkertrain.theme-panda"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "WallabyJs.console-ninja"
vscode "wayou.vscode-todo-highlight"
